einergehtnochrein/ra-firmware/lpc54000/inc/lpc54xxx_clkpwr.h
/* Copyright (c) 2014-2016, DF9DQ
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * Redistributions of source code must retain the above copyright notice, this list
 * of conditions and the following disclaimer.
 * Redistributions in binary form must reproduce the above copyright notice, this list
 * of conditions and the following disclaimer in the documentation and/or
 * other materials provided with the distribution.
 * Neither the name of the author nor the names of its contributors may be used
 * to endorse or promote products derived from this software without specific
 * prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/** \file
 *  \brief CLKPWR driver interface.
 *  This file defines all interface objects needed to use the CLKPWR driver.
 */


#ifndef __LPC54XXX_CLKPWR_H__
#define __LPC54XXX_CLKPWR_H__

/** \defgroup CLKPWR
 *  \ingroup API
 *  @{
 */

#include "lpc54xxx_libconfig.h"
#include "lpclib_types.h"


/** \defgroup CLKPWR_Public_Types CLKPWR Types, enums, macros
 *  @{
 */

#define CLKPWR_OSCILLATOR_IRC       1
#define CLKPWR_OSCILLATOR_SYSTEM    2


typedef enum CLKPWR_Clockswitch {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    CLKPWR_CLOCKSWITCH_ROM                  = 1,
    CLKPWR_CLOCKSWITCH_SRAM1                = 3,
    CLKPWR_CLOCKSWITCH_SRAM2                = 4,
    CLKPWR_CLOCKSWITCH_FLASH                = 7,
    CLKPWR_CLOCKSWITCH_FMC                  = 8,
    CLKPWR_CLOCKSWITCH_INPUTMUX             = 11,
    CLKPWR_CLOCKSWITCH_IOCON                = 13,
    CLKPWR_CLOCKSWITCH_GPIO0                = 14,
    CLKPWR_CLOCKSWITCH_GPIO1                = 15,
    CLKPWR_CLOCKSWITCH_PINT                 = 18,
    CLKPWR_CLOCKSWITCH_GINT                 = 19,
    CLKPWR_CLOCKSWITCH_DMA                  = 20,
    CLKPWR_CLOCKSWITCH_CRC                  = 21,
    CLKPWR_CLOCKSWITCH_WWDT                 = 22,
    CLKPWR_CLOCKSWITCH_RTC                  = 23,
    CLKPWR_CLOCKSWITCH_MAILBOX              = 26,
    CLKPWR_CLOCKSWITCH_ADC0                 = 27,
    CLKPWR_CLOCKSWITCH_MRT                  = 32 + 0,
    CLKPWR_CLOCKSWITCH_RIT                  = 32 + 1,
    CLKPWR_CLOCKSWITCH_SCT0                 = 32 + 2,
    CLKPWR_CLOCKSWITCH_FIFO                 = 32 + 9,
    CLKPWR_CLOCKSWITCH_UTICK                = 32 + 10,
    CLKPWR_CLOCKSWITCH_TIMER2               = 32 + 22,
    CLKPWR_CLOCKSWITCH_TIMER3               = 32 + 26,
    CLKPWR_CLOCKSWITCH_TIMER4               = 32 + 27,
    CLKPWR_CLOCKSWITCH_EZH                  = 32 + 31,
    CLKPWR_CLOCKSWITCH_UART0                = 64 + 1,
    CLKPWR_CLOCKSWITCH_UART1                = 64 + 2,
    CLKPWR_CLOCKSWITCH_UART2                = 64 + 3,
    CLKPWR_CLOCKSWITCH_UART3                = 64 + 4,
    CLKPWR_CLOCKSWITCH_I2C0                 = 64 + 5,
    CLKPWR_CLOCKSWITCH_I2C1                 = 64 + 6,
    CLKPWR_CLOCKSWITCH_I2C2                 = 64 + 7,
    CLKPWR_CLOCKSWITCH_SPI0                 = 64 + 9,
    CLKPWR_CLOCKSWITCH_SPI1                 = 64 + 10,
    CLKPWR_CLOCKSWITCH_TIMER0               = 64 + 13,
    CLKPWR_CLOCKSWITCH_TIMER1               = 64 + 14,
    CLKPWR_CLOCKSWITCH_FRG0                 = 64 + 15,
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    CLKPWR_CLOCKSWITCH_ROM                  = 1,
    CLKPWR_CLOCKSWITCH_SRAM1                = 3,
    CLKPWR_CLOCKSWITCH_SRAM2                = 4,
    CLKPWR_CLOCKSWITCH_FLASH                = 7,
    CLKPWR_CLOCKSWITCH_FMC                  = 8,
    CLKPWR_CLOCKSWITCH_INPUTMUX             = 11,
    CLKPWR_CLOCKSWITCH_IOCON                = 13,
    CLKPWR_CLOCKSWITCH_GPIO0                = 14,
    CLKPWR_CLOCKSWITCH_GPIO1                = 15,
    CLKPWR_CLOCKSWITCH_PINT                 = 18,
    CLKPWR_CLOCKSWITCH_GINT                 = 19,
    CLKPWR_CLOCKSWITCH_DMA                  = 20,
    CLKPWR_CLOCKSWITCH_CRC                  = 21,
    CLKPWR_CLOCKSWITCH_WWDT                 = 22,
    CLKPWR_CLOCKSWITCH_RTC                  = 23,
    CLKPWR_CLOCKSWITCH_MAILBOX              = 26,
    CLKPWR_CLOCKSWITCH_ADC0                 = 27,
    CLKPWR_CLOCKSWITCH_MRT                  = 32 + 0,
    CLKPWR_CLOCKSWITCH_SCT0                 = 32 + 2,
    CLKPWR_CLOCKSWITCH_UTICK                = 32 + 10,
    CLKPWR_CLOCKSWITCH_FLEXCOMM0            = 32 + 11,
    CLKPWR_CLOCKSWITCH_FLEXCOMM1            = 32 + 12,
    CLKPWR_CLOCKSWITCH_FLEXCOMM2            = 32 + 13,
    CLKPWR_CLOCKSWITCH_FLEXCOMM3            = 32 + 14,
    CLKPWR_CLOCKSWITCH_FLEXCOMM4            = 32 + 15,
    CLKPWR_CLOCKSWITCH_FLEXCOMM5            = 32 + 16,
    CLKPWR_CLOCKSWITCH_FLEXCOMM6            = 32 + 17,
    CLKPWR_CLOCKSWITCH_FLEXCOMM7            = 32 + 18,
    CLKPWR_CLOCKSWITCH_UART0                = CLKPWR_CLOCKSWITCH_FLEXCOMM0,
    CLKPWR_CLOCKSWITCH_UART1                = CLKPWR_CLOCKSWITCH_FLEXCOMM1,
    CLKPWR_CLOCKSWITCH_UART2                = CLKPWR_CLOCKSWITCH_FLEXCOMM2,
    CLKPWR_CLOCKSWITCH_UART3                = CLKPWR_CLOCKSWITCH_FLEXCOMM3,
    CLKPWR_CLOCKSWITCH_UART4                = CLKPWR_CLOCKSWITCH_FLEXCOMM4,
    CLKPWR_CLOCKSWITCH_UART5                = CLKPWR_CLOCKSWITCH_FLEXCOMM5,
    CLKPWR_CLOCKSWITCH_UART6                = CLKPWR_CLOCKSWITCH_FLEXCOMM6,
    CLKPWR_CLOCKSWITCH_UART7                = CLKPWR_CLOCKSWITCH_FLEXCOMM7,
    CLKPWR_CLOCKSWITCH_I2C0                 = CLKPWR_CLOCKSWITCH_FLEXCOMM0,
    CLKPWR_CLOCKSWITCH_I2C1                 = CLKPWR_CLOCKSWITCH_FLEXCOMM1,
    CLKPWR_CLOCKSWITCH_I2C2                 = CLKPWR_CLOCKSWITCH_FLEXCOMM2,
    CLKPWR_CLOCKSWITCH_I2C3                 = CLKPWR_CLOCKSWITCH_FLEXCOMM3,
    CLKPWR_CLOCKSWITCH_I2C4                 = CLKPWR_CLOCKSWITCH_FLEXCOMM4,
    CLKPWR_CLOCKSWITCH_I2C5                 = CLKPWR_CLOCKSWITCH_FLEXCOMM5,
    CLKPWR_CLOCKSWITCH_I2C6                 = CLKPWR_CLOCKSWITCH_FLEXCOMM6,
    CLKPWR_CLOCKSWITCH_I2C7                 = CLKPWR_CLOCKSWITCH_FLEXCOMM7,
    CLKPWR_CLOCKSWITCH_SPI0                 = CLKPWR_CLOCKSWITCH_FLEXCOMM0,
    CLKPWR_CLOCKSWITCH_SPI1                 = CLKPWR_CLOCKSWITCH_FLEXCOMM1,
    CLKPWR_CLOCKSWITCH_SPI2                 = CLKPWR_CLOCKSWITCH_FLEXCOMM2,
    CLKPWR_CLOCKSWITCH_SPI3                 = CLKPWR_CLOCKSWITCH_FLEXCOMM3,
    CLKPWR_CLOCKSWITCH_SPI4                 = CLKPWR_CLOCKSWITCH_FLEXCOMM4,
    CLKPWR_CLOCKSWITCH_SPI5                 = CLKPWR_CLOCKSWITCH_FLEXCOMM5,
    CLKPWR_CLOCKSWITCH_SPI6                 = CLKPWR_CLOCKSWITCH_FLEXCOMM6,
    CLKPWR_CLOCKSWITCH_SPI7                 = CLKPWR_CLOCKSWITCH_FLEXCOMM7,
    CLKPWR_CLOCKSWITCH_DMIC                 = 32 + 19,
    CLKPWR_CLOCKSWITCH_TIMER2               = 32 + 22,
    CLKPWR_CLOCKSWITCH_USB                  = 32 + 25,
    CLKPWR_CLOCKSWITCH_TIMER0               = 32 + 26,
    CLKPWR_CLOCKSWITCH_TIMER1               = 32 + 27,
    CLKPWR_CLOCKSWITCH_EZH                  = 32 + 31,
    CLKPWR_CLOCKSWITCH_TIMER3               = 64 + 13,
    CLKPWR_CLOCKSWITCH_TIMER4               = 64 + 14,
#endif
} CLKPWR_Clockswitch;

typedef enum CLKPWR_Divider {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    CLKPWR_DIVIDER_AHB                      = 64,
    CLKPWR_DIVIDER_ADC                      = 66,
    CLKPWR_DIVIDER_CLKOUT                   = 67,
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    CLKPWR_DIVIDER_AHB                      = 224,
    CLKPWR_DIVIDER_CLKOUT                   = 225,
    CLKPWR_DIVIDER_ADC                      = 229,
    CLKPWR_DIVIDER_USB                      = 230,
    CLKPWR_DIVIDER_DMIC                     = 234,
    CLKPWR_DIVIDER_I2SMCLK                  = 235,
#endif
} CLKPWR_Divider;


typedef enum CLKPWR_Clock {
    _CLKPWR_CLOCK_NONE = 0,
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    _CLKPWR_CLOCK_MAINCLKSELA,
    _CLKPWR_CLOCK_ASYNCCLKSELA,

    CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_IRC,
    CLKPWR_CLOCK_WDT,
    CLKPWR_CLOCK_MAIN,
    CLKPWR_CLOCK_CLKIN,
    CLKPWR_CLOCK_SYSTEMPLLIN,
    CLKPWR_CLOCK_SYSTEMPLL,
    CLKPWR_CLOCK_ADC,
    CLKPWR_CLOCK_RTC,
    CLKPWR_CLOCK_CPU,

    CLKPWR_CLOCK_TIMER2 = CLKPWR_CLOCK_CPU,
    CLKPWR_CLOCK_TIMER3 = CLKPWR_CLOCK_CPU,
    CLKPWR_CLOCK_TIMER4 = CLKPWR_CLOCK_CPU,

    CLKPWR_CLOCK_UART0 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_UART1 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_UART2 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_UART3 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_I2C0 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_I2C1 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_I2C2 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_SPI0 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_SPI1 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_TIMER0 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_TIMER1 = CLKPWR_CLOCK_ASYNCAPB,
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    _CLKPWR_CLOCK_MAINCLKSELA,
    _CLKPWR_CLOCK_ASYNCCLKSELA,

    CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_FRO12,
    CLKPWR_CLOCK_FROHF,
    CLKPWR_CLOCK_WDT,
    CLKPWR_CLOCK_MAIN,
    CLKPWR_CLOCK_CLKIN,
    CLKPWR_CLOCK_SYSTEMPLLIN,
    CLKPWR_CLOCK_SYSTEMPLL,
    CLKPWR_CLOCK_ADC,
    CLKPWR_CLOCK_FRG,
    CLKPWR_CLOCK_MCLK,
    CLKPWR_CLOCK_DMIC,
    CLKPWR_CLOCK_RTC,
    CLKPWR_CLOCK_CPU,

    CLKPWR_CLOCK_BUS_CPU            =                   (      0 << 16) | (   0xFF << 16) | (      0 << 0),
    CLKPWR_CLOCK_BUS_ASYNCAPB       =                   (      1 << 16) | (   0xFF << 16) | (      1 << 0),
    CLKPWR_CLOCK_BUS_FRO12          =                   (   0xFF << 16) | (   0xFF << 16) | (      2 << 0),
    CLKPWR_CLOCK_BUS_FROHF          =                   (   0xFF << 16) | (   0xFF << 16) | (      3 << 0),
    CLKPWR_CLOCK_BUS_WDT            =                   (   0xFF << 16) | (   0xFF << 16) | (      4 << 0),
    CLKPWR_CLOCK_BUS_MAIN           =                   (      2 << 16) | (   0xFF << 16) | (      5 << 0),
    CLKPWR_CLOCK_BUS_MAINA          =                   (      3 << 16) | (   0xFF << 16) | (      6 << 0),
    CLKPWR_CLOCK_BUS_CLKIN          =                   (   0xFF << 16) | (   0xFF << 16) | (      7 << 0),
    CLKPWR_CLOCK_BUS_SYSTEMPLLIN    =                   (      4 << 16) | (   0xFF << 16) | (      8 << 0),
    CLKPWR_CLOCK_BUS_SYSTEMPLL      =                   (   0xFF << 16) | (   0xFF << 16) | (      9 << 0),
    CLKPWR_CLOCK_BUS_ADC            =                   (      5 << 16) | (   0xFF << 16) | (     10 << 0),
    CLKPWR_CLOCK_BUS_MCLK           =                   (      6 << 16) | (   0xFF << 16) | (     11 << 0),
    CLKPWR_CLOCK_BUS_DMIC           =                   (      7 << 16) | (   0xFF << 16) | (     12 << 0),
    CLKPWR_CLOCK_BUS_RTC            =                   (      8 << 16) | (   0xFF << 16) | (     13 << 0),

    CLKPWR_CLOCK_PER_TIMER0         = (      0 << 24) | (   0xFF << 16) | ((32+26) << 16) | ((32+ 0) << 0),
    CLKPWR_CLOCK_PER_TIMER1         = (      0 << 24) | (   0xFF << 16) | ((32+27) << 16) | ((32+ 1) << 0),
    CLKPWR_CLOCK_PER_TIMER2         = (      0 << 24) | (   0xFF << 16) | ((32+22) << 16) | ((32+ 2) << 0),
    CLKPWR_CLOCK_PER_TIMER3         = (      0 << 24) | (   0xFF << 16) | ((32+22) << 16) | ((32+ 3) << 0),
    CLKPWR_CLOCK_PER_TIMER4         = (      0 << 24) | (   0xFF << 16) | ((32+22) << 16) | ((32+ 4) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM0      =                   (     16 << 16) | ((32+11) << 16) | ((32+ 5) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM1      =                   (     17 << 16) | ((32+12) << 16) | ((32+ 6) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM2      =                   (     18 << 16) | ((32+13) << 16) | ((32+ 7) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM3      =                   (     19 << 16) | ((32+14) << 16) | ((32+ 8) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM4      =                   (     20 << 16) | ((32+15) << 16) | ((32+ 9) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM5      =                   (     21 << 16) | ((32+16) << 16) | ((32+10) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM6      =                   (     22 << 16) | ((32+17) << 16) | ((32+11) << 0),
    CLKPWR_CLOCK_PER_FLEXCOMM7      =                   (     23 << 16) | ((32+18) << 16) | ((32+12) << 0),
    CLKPWR_CLOCK_PER_UART0          = CLKPWR_CLOCK_PER_FLEXCOMM0,
    CLKPWR_CLOCK_PER_UART1          = CLKPWR_CLOCK_PER_FLEXCOMM1,
    CLKPWR_CLOCK_PER_UART2          = CLKPWR_CLOCK_PER_FLEXCOMM2,
    CLKPWR_CLOCK_PER_UART3          = CLKPWR_CLOCK_PER_FLEXCOMM3,
    CLKPWR_CLOCK_PER_UART4          = CLKPWR_CLOCK_PER_FLEXCOMM4,
    CLKPWR_CLOCK_PER_UART5          = CLKPWR_CLOCK_PER_FLEXCOMM5,
    CLKPWR_CLOCK_PER_UART6          = CLKPWR_CLOCK_PER_FLEXCOMM6,
    CLKPWR_CLOCK_PER_UART7          = CLKPWR_CLOCK_PER_FLEXCOMM7,
    CLKPWR_CLOCK_PER_SPI0           = CLKPWR_CLOCK_PER_FLEXCOMM0,
    CLKPWR_CLOCK_PER_SPI1           = CLKPWR_CLOCK_PER_FLEXCOMM1,
    CLKPWR_CLOCK_PER_SPI2           = CLKPWR_CLOCK_PER_FLEXCOMM2,
    CLKPWR_CLOCK_PER_SPI3           = CLKPWR_CLOCK_PER_FLEXCOMM3,
    CLKPWR_CLOCK_PER_SPI4           = CLKPWR_CLOCK_PER_FLEXCOMM4,
    CLKPWR_CLOCK_PER_SPI5           = CLKPWR_CLOCK_PER_FLEXCOMM5,
    CLKPWR_CLOCK_PER_SPI6           = CLKPWR_CLOCK_PER_FLEXCOMM6,
    CLKPWR_CLOCK_PER_SPI7           = CLKPWR_CLOCK_PER_FLEXCOMM7,
    CLKPWR_CLOCK_PER_I2C0           = CLKPWR_CLOCK_PER_FLEXCOMM0,
    CLKPWR_CLOCK_PER_I2C1           = CLKPWR_CLOCK_PER_FLEXCOMM1,
    CLKPWR_CLOCK_PER_I2C2           = CLKPWR_CLOCK_PER_FLEXCOMM2,
    CLKPWR_CLOCK_PER_I2C3           = CLKPWR_CLOCK_PER_FLEXCOMM3,
    CLKPWR_CLOCK_PER_I2C4           = CLKPWR_CLOCK_PER_FLEXCOMM4,
    CLKPWR_CLOCK_PER_I2C5           = CLKPWR_CLOCK_PER_FLEXCOMM5,
    CLKPWR_CLOCK_PER_I2C6           = CLKPWR_CLOCK_PER_FLEXCOMM6,
    CLKPWR_CLOCK_PER_I2C7           = CLKPWR_CLOCK_PER_FLEXCOMM7,

    CLKPWR_CLOCK_PER_ROM            =                   (   0xFF << 16) | ((32+ 1) << 16) | ((32+13) << 0),
    CLKPWR_CLOCK_PER_SRAM1          =                   (   0xFF << 16) | ((32+ 3) << 16) | ((32+14) << 0),
    CLKPWR_CLOCK_PER_SRAM2          =                   (   0xFF << 16) | ((32+ 4) << 16) | ((32+15) << 0),
    CLKPWR_CLOCK_PER_FLASH          =                   (   0xFF << 16) | ((32+ 7) << 16) | ((32+16) << 0),
    CLKPWR_CLOCK_PER_FMC            =                   (   0xFF << 16) | ((32+ 8) << 16) | ((32+17) << 0),
    CLKPWR_CLOCK_PER_INPUTMUX       =                   (   0xFF << 16) | ((32+11) << 16) | ((32+18) << 0),
    CLKPWR_CLOCK_PER_IOCON          =                   (   0xFF << 16) | ((32+13) << 16) | ((32+19) << 0),
    CLKPWR_CLOCK_PER_GPIO0          =                   (   0xFF << 16) | ((32+14) << 16) | ((32+20) << 0),
    CLKPWR_CLOCK_PER_GPIO1          =                   (   0xFF << 16) | ((32+15) << 16) | ((32+21) << 0),
    CLKPWR_CLOCK_PER_PINT           =                   (   0xFF << 16) | ((32+18) << 16) | ((32+22) << 0),
    CLKPWR_CLOCK_PER_GINT           =                   (   0xFF << 16) | ((32+19) << 16) | ((32+23) << 0),
    CLKPWR_CLOCK_PER_DMA            =                   (   0xFF << 16) | ((32+20) << 16) | ((32+24) << 0),
    CLKPWR_CLOCK_PER_CRC            =                   (   0xFF << 16) | ((32+21) << 16) | ((32+25) << 0),
    CLKPWR_CLOCK_PER_WWDT           =                   (   0xFF << 16) | ((32+22) << 16) | ((32+26) << 0),
    CLKPWR_CLOCK_PER_RTC            =                   (   0xFF << 16) | ((32+23) << 16) | ((32+27) << 0),
    CLKPWR_CLOCK_PER_MAILBOX        =                   (   0xFF << 16) | ((32+26) << 16) | ((32+28) << 0),
    CLKPWR_CLOCK_PER_ADC0           =                   (   0xFF << 16) | ((32+27) << 16) | ((32+29) << 0),
    CLKPWR_CLOCK_PER_MRT            =                   (   0xFF << 16) | ((64+ 0) << 16) | ((32+30) << 0),
    CLKPWR_CLOCK_PER_SCT0           =                   (   0xFF << 16) | ((64+ 2) << 16) | ((32+31) << 0),
    CLKPWR_CLOCK_PER_UTICK          =                   (   0xFF << 16) | ((64+10) << 16) | ((32+32) << 0),
    CLKPWR_CLOCK_PER_DMIC           =                   (   0xFF << 16) | ((64+19) << 16) | ((32+33) << 0),
    CLKPWR_CLOCK_PER_USB            =                   (   0xFF << 16) | ((64+25) << 16) | ((32+34) << 0),
    CLKPWR_CLOCK_PER_EZH            =                   (   0xFF << 16) | ((64+31) << 16) | ((32+35) << 0),

    CLKPWR_CLOCK_TIMER0 = CLKPWR_CLOCK_CPU,
    CLKPWR_CLOCK_TIMER1 = CLKPWR_CLOCK_CPU,
    CLKPWR_CLOCK_TIMER2 = CLKPWR_CLOCK_CPU,
    CLKPWR_CLOCK_FLEXCOMM0,
    CLKPWR_CLOCK_FLEXCOMM1,
    CLKPWR_CLOCK_FLEXCOMM2,
    CLKPWR_CLOCK_FLEXCOMM3,
    CLKPWR_CLOCK_FLEXCOMM4,
    CLKPWR_CLOCK_FLEXCOMM5,
    CLKPWR_CLOCK_FLEXCOMM6,
    CLKPWR_CLOCK_FLEXCOMM7,
    CLKPWR_CLOCK_UART0 = CLKPWR_CLOCK_FLEXCOMM0,
    CLKPWR_CLOCK_UART1 = CLKPWR_CLOCK_FLEXCOMM1,
    CLKPWR_CLOCK_UART2 = CLKPWR_CLOCK_FLEXCOMM2,
    CLKPWR_CLOCK_UART3 = CLKPWR_CLOCK_FLEXCOMM3,
    CLKPWR_CLOCK_UART4 = CLKPWR_CLOCK_FLEXCOMM4,
    CLKPWR_CLOCK_UART5 = CLKPWR_CLOCK_FLEXCOMM5,
    CLKPWR_CLOCK_UART6 = CLKPWR_CLOCK_FLEXCOMM6,
    CLKPWR_CLOCK_UART7 = CLKPWR_CLOCK_FLEXCOMM7,
    CLKPWR_CLOCK_SPI0 = CLKPWR_CLOCK_FLEXCOMM0,
    CLKPWR_CLOCK_SPI1 = CLKPWR_CLOCK_FLEXCOMM1,
    CLKPWR_CLOCK_SPI2 = CLKPWR_CLOCK_FLEXCOMM2,
    CLKPWR_CLOCK_SPI3 = CLKPWR_CLOCK_FLEXCOMM3,
    CLKPWR_CLOCK_SPI4 = CLKPWR_CLOCK_FLEXCOMM4,
    CLKPWR_CLOCK_SPI5 = CLKPWR_CLOCK_FLEXCOMM5,
    CLKPWR_CLOCK_SPI6 = CLKPWR_CLOCK_FLEXCOMM6,
    CLKPWR_CLOCK_SPI7 = CLKPWR_CLOCK_FLEXCOMM7,
    CLKPWR_CLOCK_I2C0 = CLKPWR_CLOCK_FLEXCOMM0,
    CLKPWR_CLOCK_I2C1 = CLKPWR_CLOCK_FLEXCOMM1,
    CLKPWR_CLOCK_I2C2 = CLKPWR_CLOCK_FLEXCOMM2,
    CLKPWR_CLOCK_I2C3 = CLKPWR_CLOCK_FLEXCOMM3,
    CLKPWR_CLOCK_I2C4 = CLKPWR_CLOCK_FLEXCOMM4,
    CLKPWR_CLOCK_I2C5 = CLKPWR_CLOCK_FLEXCOMM5,
    CLKPWR_CLOCK_I2C6 = CLKPWR_CLOCK_FLEXCOMM6,
    CLKPWR_CLOCK_I2C7 = CLKPWR_CLOCK_FLEXCOMM7,

