einergehtnochrein/ra-firmware/lpc54000/inc/lpc54xxx_clkpwr.h
    CLKPWR_CLOCK_TIMER3 = CLKPWR_CLOCK_ASYNCAPB,
    CLKPWR_CLOCK_TIMER4 = CLKPWR_CLOCK_ASYNCAPB,
#endif
} CLKPWR_Clock;

typedef enum CLKPWR_Reset {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    CLKPWR_RESET_FLASH = 7,
    CLKPWR_RESET_FMC = 8,
    CLKPWR_RESET_MUX = 11,
    CLKPWR_RESET_IOCON = 13,
    CLKPWR_RESET_GPIO0 = 14,
    CLKPWR_RESET_GPIO1 = 15,
    CLKPWR_RESET_PINT = 18,
    CLKPWR_RESET_GINT = 19,
    CLKPWR_RESET_DMA = 20,
    CLKPWR_RESET_CRC = 21,
    CLKPWR_RESET_WWDT = 22,
    CLKPWR_RESET_ADC0 = 27,
    CLKPWR_RESET_MRT = 32 + 0,
    CLKPWR_RESET_RIT = 32 + 1,
    CLKPWR_RESET_SCT0 = 32 + 2,
    CLKPWR_RESET_FIFO = 32 + 9,
    CLKPWR_RESET_UTICK = 32 + 10,
    CLKPWR_RESET_CT32B2 = 32 + 22,
    CLKPWR_RESET_CT32B3 = 32 + 26,
    CLKPWR_RESET_CT32B4 = 32 + 27,
    CLKPWR_RESET_EZH = 32 + 31,
    CLKPWR_RESET_USART0 = 64 + 1,
    CLKPWR_RESET_USART1 = 64 + 2,
    CLKPWR_RESET_USART2 = 64 + 3,
    CLKPWR_RESET_USART3 = 64 + 4,
    CLKPWR_RESET_I2C0 = 64 + 5,
    CLKPWR_RESET_I2C1 = 64 + 6,
    CLKPWR_RESET_I2C2 = 64 + 7,
    CLKPWR_RESET_SPI0 = 64 + 9,
    CLKPWR_RESET_SPI1 = 64 + 10,
    CLKPWR_RESET_CT32B0 = 64 + 13,
    CLKPWR_RESET_CT32B1 = 64 + 14,
    CLKPWR_RESET_FRG0 = 64 + 15,
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    CLKPWR_RESET_FLASH = 7,
    CLKPWR_RESET_FMC = 8,
    CLKPWR_RESET_MUX = 11,
    CLKPWR_RESET_IOCON = 13,
    CLKPWR_RESET_GPIO0 = 14,
    CLKPWR_RESET_GPIO1 = 15,
    CLKPWR_RESET_PINT = 18,
    CLKPWR_RESET_GINT = 19,
    CLKPWR_RESET_DMA = 20,
    CLKPWR_RESET_CRC = 21,
    CLKPWR_RESET_WWDT = 22,
    CLKPWR_RESET_ADC0 = 27,
    CLKPWR_RESET_MRT = 32 + 0,
    CLKPWR_RESET_SCT0 = 32 + 2,
    CLKPWR_RESET_UTICK = 32 + 10,
    CLKPWR_RESET_FLEXCOMM0 = 32 + 11,
    CLKPWR_RESET_FLEXCOMM1 = 32 + 12,
    CLKPWR_RESET_FLEXCOMM2 = 32 + 13,
    CLKPWR_RESET_FLEXCOMM3 = 32 + 14,
    CLKPWR_RESET_FLEXCOMM4 = 32 + 15,
    CLKPWR_RESET_FLEXCOMM5 = 32 + 16,
    CLKPWR_RESET_FLEXCOMM6 = 32 + 17,
    CLKPWR_RESET_FLEXCOMM7 = 32 + 18,
    CLKPWR_RESET_UART0 = CLKPWR_RESET_FLEXCOMM0,
    CLKPWR_RESET_UART1 = CLKPWR_RESET_FLEXCOMM1,
    CLKPWR_RESET_UART2 = CLKPWR_RESET_FLEXCOMM2,
    CLKPWR_RESET_UART3 = CLKPWR_RESET_FLEXCOMM3,
    CLKPWR_RESET_UART4 = CLKPWR_RESET_FLEXCOMM4,
    CLKPWR_RESET_UART5 = CLKPWR_RESET_FLEXCOMM5,
    CLKPWR_RESET_UART6 = CLKPWR_RESET_FLEXCOMM6,
    CLKPWR_RESET_UART7 = CLKPWR_RESET_FLEXCOMM7,
    CLKPWR_RESET_SPI0 = CLKPWR_RESET_FLEXCOMM0,
    CLKPWR_RESET_SPI1 = CLKPWR_RESET_FLEXCOMM1,
    CLKPWR_RESET_SPI2 = CLKPWR_RESET_FLEXCOMM2,
    CLKPWR_RESET_SPI3 = CLKPWR_RESET_FLEXCOMM3,
    CLKPWR_RESET_SPI4 = CLKPWR_RESET_FLEXCOMM4,
    CLKPWR_RESET_SPI5 = CLKPWR_RESET_FLEXCOMM5,
    CLKPWR_RESET_SPI6 = CLKPWR_RESET_FLEXCOMM6,
    CLKPWR_RESET_SPI7 = CLKPWR_RESET_FLEXCOMM7,
    CLKPWR_RESET_I2C0 = CLKPWR_RESET_FLEXCOMM0,
    CLKPWR_RESET_I2C1 = CLKPWR_RESET_FLEXCOMM1,
    CLKPWR_RESET_I2C2 = CLKPWR_RESET_FLEXCOMM2,
    CLKPWR_RESET_I2C3 = CLKPWR_RESET_FLEXCOMM3,
    CLKPWR_RESET_I2C4 = CLKPWR_RESET_FLEXCOMM4,
    CLKPWR_RESET_I2C5 = CLKPWR_RESET_FLEXCOMM5,
    CLKPWR_RESET_I2C6 = CLKPWR_RESET_FLEXCOMM6,
    CLKPWR_RESET_I2C7 = CLKPWR_RESET_FLEXCOMM7,
    CLKPWR_RESET_DMIC = 32 + 19,
    CLKPWR_RESET_CTIMER2 = 32 + 22,
    CLKPWR_RESET_USB = 32 + 25,
    CLKPWR_RESET_CTIMER0 = 32 + 26,
    CLKPWR_RESET_CTIMER1 = 32 + 27,
    CLKPWR_RESET_EZH = 32 + 31,
    CLKPWR_RESET_CTIMER3 = 64 + 13,
    CLKPWR_RESET_CTIMER4 = 64 + 14,
#endif
} CLKPWR_Reset;

typedef enum CLKPWR_UnitPower {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    CLKPWR_UNITPOWER___DUMMY__,
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    CLKPWR_UNIT_FRO = 4,
    CLKPWR_UNIT_TS = 6,
    CLKPWR_UNIT_BODRST = 7,
    CLKPWR_UNIT_BODINTR = 8,
    CLKPWR_UNIT_ADC0 = 10,
    CLKPWR_UNIT_SRAM0 = 13,
    CLKPWR_UNIT_SRAM1 = 14,
    CLKPWR_UNIT_SRAM2 = 15,
    CLKPWR_UNIT_SRAMX = 16,
    CLKPWR_UNIT_ROM = 17,
    CLKPWR_UNIT_VDDA = 19,
    CLKPWR_UNIT_WDTOSC = 20,
    CLKPWR_UNIT_USBPAD = 21,
    CLKPWR_UNIT_SYSPLL = 22,
    CLKPWR_UNIT_VREFP = 23,
#endif
} CLKPWR_UnitPower;


typedef enum CLKPWR_PowerSavingMode {
    CLKPWR_POWERSAVING_SLEEP            = (0u << 16) | (1u <<  8) | 0,
    CLKPWR_POWERSAVING_DEEPSLEEP        = (1u << 16) | (1u <<  9) | 0,
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    CLKPWR_POWERSAVING_POWERDOWN        = (1u << 16) | (1u << 10) | 1,
#endif
    CLKPWR_POWERSAVING_DEEPPOWERDOWN    = (1u << 16) | (1u << 11) | 3,
} CLKPWR_PowerSavingMode;



/** @} CLKPWR Types, enums, macros */


/** \defgroup CLKPWR_Public_Functions CLKPWR API Functions
 *  @{
 */


/** Return the clock frequency of an internal bus.
 *
 *  \param[in] bus The bus to be queried
 *  \return Bus clock in Hz
 */
uint32_t CLKPWR_getBusClock (CLKPWR_Clock clock);


/** Enable a clock signal.
 *
 *  \param[in] clock Clock switch selector
 */
static void CLKPWR_enableClock (CLKPWR_Clockswitch clock);


/** Disable a clock signal.
 *
 *  \param[in] clock Clock switch selector
 */
static void CLKPWR_disableClock (CLKPWR_Clockswitch clock);


/** Power up a functional unit.
 *
 *  \param[in] unit Unit selector
 */
static void CLKPWR_unitPowerUp (CLKPWR_UnitPower unit);


/** Power down a functional unit.
 *
 *  \param[in] unit Unit selector
 */
static void CLKPWR_unitPowerDown (CLKPWR_UnitPower unit);


/** Assert the reset signal of the selected peripheral block.
 *
 *  \param[in] peripheral Peripheral block selector
 */
static void CLKPWR_assertPeripheralReset (CLKPWR_Reset peripheral);


/** Deassert the reset signal of the selected peripheral block.
 *
 *  \param[in] peripheral Peripheral block selector
 */
static void CLKPWR_deassertPeripheralReset (CLKPWR_Reset peripheral);


/** Reset all peripherals.
 *
 *  Apply a reset to all peripherals. This can be useful to do at system startup in a
 *  debug session. In this case the peripherals may be in an undefined state, already
 *  fully or partially initialized from a previous run of the code.
 */
void CLKPWR_resetAllPeripherals (void);


