einergehtnochrein/ra-firmware/lpc54000/inc/lpc54xxx_clkpwr.h
/** Set a clock divider.
 *
 *  \param[in] divider Clock divider selector
 *  \param[in] value Division ratio
 *  \retval LPCLIB_SUCCESS Divider was set as requested.
 *  \retval LPCLIB_ILLEGAL_PARAMETER Divider cannot be set
 *          LPC178x: Use 'CLKPWR_DIVIDER_PCLK' to set the global
 *                   peripheral clock common to all peripherals.)
 *                   Use 'CLKPWR_DIVIDER_EMC' to set the CCLK vs EMC clock ratio.
 *          LPC17xx: You cannot use CLKPWR_DIVIDER_PCLK or CLKPWR_DIVIDER_EMC here.
 *                   Use individual peripheral clock selectors.
 */
LPCLIB_Result CLKPWR_setDivider (CLKPWR_Divider divider, uint32_t value);


/** Attempts to set the CPU clock to the desired frequency.
 *
 *  Sets the CPU clock to the frequency which is closest to the requested
 *  value. Assumes that the PLL input clock has been selected before.
 *
 *  \param[in] targetCpuFrequency Desired CPU frequency (Hz)
 *  \return ...
 */
LPCLIB_Result CLKPWR_setCpuClock (uint32_t targetCpuFrequency, CLKPWR_Clock fundamentalClock);


/** Sets up the USB clock using the USB PLL.
 *
 *  Only works if the crystal frequency is an integer fraction of 48 MHz.
 *
 *  \param[in] targetCpuFrequency Desired CPU frequency (kHz)
 *  \param[out] newCpuFrequency CPU frequency (kHz) after the call
 *  \return ...
 */
LPCLIB_Result CLKPWR_setUsbClock (void);



/** Enter a power-saving mode.
 *
 *  Enters the selected power-saving mode, and does not return before a qualified
 *  wake-up event occurs.
 *  Note 1: You must prepare a suitable wake-up source before entering this function.
 *          Failure to do so may cause the system to stay in power-saving mode forever.
 *  Note 2: This function uses the WFI instruction, not WFE.
 *
 *  \param[in] mode
 */
void CLKPWR_enterPowerSaving (CLKPWR_PowerSavingMode mode);



__FORCEINLINE(void CLKPWR_unitPowerUp (CLKPWR_UnitPower unit))
{
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    (void)unit;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    LPC_SYSCON->PDRUNCFGCLR0 = (1u << unit);
#endif
}

__FORCEINLINE(void CLKPWR_unitPowerDown (CLKPWR_UnitPower unit))
{
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    (void)unit;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    LPC_SYSCON->PDRUNCFGSET0 = (1u << unit);
#endif
}

__FORCEINLINE(void CLKPWR_assertPeripheralReset (CLKPWR_Reset peripheral))
{
    if ((int)peripheral >= 64) {
        LPC_ASYNCSYSCON->ASYNCPRESETCTRLSET = (1u << ((int)peripheral % 32));
    }
    else {
        LPC_SYSCON->PRESETCTRLSET[(int)peripheral / 32] = (1u << ((int)peripheral % 32));
    }
}

__FORCEINLINE(void CLKPWR_deassertPeripheralReset (const CLKPWR_Reset peripheral))
{
    if ((int)peripheral >= 64) {
        LPC_ASYNCSYSCON->ASYNCPRESETCTRLCLR = (1u << ((int)peripheral % 32));
    }
    else {
        LPC_SYSCON->PRESETCTRLCLR[(int)peripheral / 32] = (1u << ((int)peripheral % 32));
    }
}



__FORCEINLINE(void CLKPWR_enableClock (CLKPWR_Clockswitch clock))
{
    if ((int)clock >= 64) {
        LPC_ASYNCSYSCON->ASYNCAPBCLKCTRLSET = (1u << ((int)clock % 32));
    }
    else {
        LPC_SYSCON->AHBCLKCTRLSET[(int)clock / 32] = (1u << ((int)clock % 32));
    }
}



__FORCEINLINE(void CLKPWR_disableClock (CLKPWR_Clockswitch clock))
{
    if ((int)clock >= 64) {
        LPC_ASYNCSYSCON->ASYNCAPBCLKCTRLCLR = (1u << ((int)clock % 32));
    }
    else {
        LPC_SYSCON->AHBCLKCTRLCLR[(int)clock / 32] = (1u << ((int)clock % 32));
    }
}


/** @} CLKPWR API Functions */

/** @} CLKPWR */

#endif /* #ifndef __LPC54XXX_CLKPWR_H__ */

